graph(%self : __torch__.___torch_mangle_410.ScriptableAdapter,
      %inputs.1 : (Dict(str, Tensor))):
  %2 : bool = prim::Constant[value=1]() # C:\Users\HOFTIJ~1\AppData\Local\Temp/ipykernel_15240/909090163.py:28:23
  %3 : NoneType = prim::Constant()
  %4 : bool = prim::Constant[value=0]() # C:\Users\HOFTIJ~1\AppData\Local\Temp/ipykernel_15240/909090163.py:27:72
  %model : __torch__.detectron2.modeling.meta_arch.rcnn.___torch_mangle_409.GeneralizedRCNN = prim::GetAttr[name="model"](%self)
  %6 : Dict(str, Tensor) = prim::TupleUnpack(%inputs.1)
  %7 : Dict(str, Tensor)[] = prim::ListConstruct(%6)
  %15 : str = prim::Constant[value="Empty Instances does not support __len__!"]() # C:\Users\HOFTIJ~1\AppData\Local\Temp\detectron2g90_iz5o\tmpkdd_jgbm.py:199:34
  %16 : str = prim::Constant[value="unequal value, x[0] batch dim 0 is {}, but box_list has length {}"]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\poolers.py:213:11
  %17 : str = prim::Constant[value="unequal value, num_level_assignments={}, but x is list of {} Tensors"]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\poolers.py:207:11
  %18 : float = prim::Constant[value=1e-08]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\poolers.py:53:70
  %19 : str = prim::Constant[value="AssertionError: The shape of the tensor in the boxes list is not correct as List[Tensor[L, 4]]"]()
  %20 : str = prim::Constant[value="AssertionError: The boxes tensor shape is not correct as Tensor[K, 5]"]()
  %21 : str = prim::Constant[value="AssertionError: proposal_boxes is None and cannot be accessed!"]()
  %22 : int = prim::Constant[value=6]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\anchor_generator.py:42:65
  %23 : int = prim::Constant[value=9223372036854775807]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\proposal_generator\proposal_utils.py:68:45
  %24 : str = prim::Constant[value="Indexing on Boxes with {} failed to return a matrix!"]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\boxes.py:234:29
  %25 : str = prim::Constant[value="AssertionError: Box tensor contains infinite or NaN!"]()
  %26 : str = prim::Constant[value="cpu"]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torchvision\ops\boxes.py:71:53
  %27 : int = prim::Constant[value=4000]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torchvision\ops\boxes.py:71:24
  %28 : int = prim::Constant[value=20000]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torchvision\ops\boxes.py:71:64
  %29 : int = prim::Constant[value=11]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torchvision\ops\boxes.py:105:47
  %30 : (str, str, str, str, str, str, str, str) = prim::Constant[value=("proposal_boxes", "objectness_logits", "pred_boxes", "scores", "pred_classes", "pred_masks", "pred_keypoints", "pred_keypoint_heatmaps")]()
  %31 : float = prim::Constant[value=0.5]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\box_regression.py:93:30
  %32 : int = prim::Constant[value=-4]()
  %33 : int = prim::Constant[value=-3]()
  %34 : str = prim::Constant[value="nearest"]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\fpn.py:140:88
  %35 : float = prim::Constant[value=2.]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\fpn.py:140:78
  %36 : int = prim::Constant[value=3]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:358:40
  %37 : float = prim::Constant[value=0.10000000000000001]()
  %38 : str = prim::Constant[value="ResNet takes an input of shape (N, C, H, W). Got {} instead!"]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:443:29
  %39 : str = prim::Constant[value="stem"]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:446:11
  %40 : int = prim::Constant[value=5]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torch\nn\functional.py:3892:22
  %41 : str = prim::Constant[value="Input Error: Only 3D, 4D and 5D input Tensors supported (got {}D) for the modes: nearest | linear | bilinear | bicubic | trilinear | area | nearest-exact (got {})"]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torch\nn\functional.py:3943:8
  %42 : float = prim::Constant[value=0.]()
  %43 : int = prim::Constant[value=1]()
  %44 : bool = prim::Constant[value=0]()
  %45 : str = prim::Constant[value="image"]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\meta_arch\rcnn.py:224:20
  %46 : int = prim::Constant[value=2]()
  %47 : str = prim::Constant[value="AssertionError: Padding length too large"]()
  %48 : int = prim::Constant[value=0]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:75:30
  %49 : str = prim::Constant[value="AssertionError: "]()
  %50 : int = prim::Constant[value=-2]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:79:28
  %51 : int = prim::Constant[value=-1]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:81:47
  %52 : str = prim::Constant[value="floor"]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:88:75
  %53 : int = prim::Constant[value=4]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:92:52
  %54 : NoneType = prim::Constant() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\meta_arch\rcnn.py:202:33
  %55 : bool = prim::Constant[value=1]() # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\meta_arch\rcnn.py:211:33
  %56 : str = prim::Constant[value="AssertionError: Scripting is not supported for postprocess."]()
  %57 : __torch__.detectron2.export.torchscript_patch11.ScriptedInstances11[] = prim::Uninitialized()
  %images.1 : Tensor[] = prim::ListConstruct()
  %59 : int = aten::len(%7) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\meta_arch\rcnn.py:224:17
   = prim::Loop(%59, %55) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\meta_arch\rcnn.py:224:17
    block0(%60 : int):
      %x.45 : Dict(str, Tensor) = aten::__getitem__(%7, %60) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\meta_arch\rcnn.py:224:17
      %62 : Tensor = aten::__getitem__(%x.45, %45) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\meta_arch\rcnn.py:224:18
      %pixel_mean.2 : Tensor = prim::GetAttr[name="pixel_mean"](%model)
      %64 : Device = prim::device(%pixel_mean.2)
      %65 : Tensor = aten::to(%62, %64, %54, %44, %44) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\meta_arch\rcnn.py:224:18
      %66 : Tensor[] = aten::append(%images.1, %65) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\meta_arch\rcnn.py:224:17
      -> (%55)
  %images.5 : Tensor[] = prim::ListConstruct()
  %68 : int = aten::len(%images.1) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\meta_arch\rcnn.py:225:17
   = prim::Loop(%68, %55) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\meta_arch\rcnn.py:225:17
    block0(%69 : int):
      %x.39 : Tensor = aten::__getitem__(%images.1, %69) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\meta_arch\rcnn.py:225:17
      %pixel_mean.1 : Tensor = prim::GetAttr[name="pixel_mean"](%model)
      %72 : Tensor = aten::sub(%x.39, %pixel_mean.1, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\meta_arch\rcnn.py:225:19
      %pixel_std : Tensor = prim::GetAttr[name="pixel_std"](%model)
      %74 : Tensor = aten::div(%72, %pixel_std) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\meta_arch\rcnn.py:225:19
      %75 : Tensor[] = aten::append(%images.5, %74) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\meta_arch\rcnn.py:225:17
      -> (%55)
  %backbone : __torch__.detectron2.modeling.backbone.fpn.___torch_mangle_389.FPN = prim::GetAttr[name="backbone"](%model)
  %_size_divisibility : int = prim::GetAttr[name="_size_divisibility"](%backbone)
  %78 : int = aten::len(%images.5) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:75:15
  %79 : bool = aten::gt(%78, %48) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:75:15
   = prim::If(%79) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:75:8
    block0():
      -> ()
    block1():
       = prim::RaiseException(%49, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:75:8
      -> ()
  %80 : int = aten::len(%images.5) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:77:8
   = prim::Loop(%80, %55) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:77:8
    block0(%81 : int):
      %t.2 : Tensor = aten::__getitem__(%images.5, %81) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:77:8
      %83 : int[] = aten::size(%t.2) # <string>:13:9
      %84 : int[] = aten::slice(%83, %54, %50, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:79:19
      %85 : Tensor = aten::__getitem__(%images.5, %48) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:79:35
      %86 : int[] = aten::size(%85) # <string>:13:9
      %87 : int[] = aten::slice(%86, %54, %50, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:79:35
      %88 : bool = aten::eq(%84, %87) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:79:19
       = prim::If(%88) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:79:12
        block0():
          -> ()
        block1():
          %89 : int[] = aten::size(%t.2) # <string>:13:9
          %90 : str = aten::str(%89) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:79:12
          %91 : str = aten::add(%49, %90) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:79:12
           = prim::RaiseException(%91, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:79:12
          -> ()
      -> (%55)
  %image_sizes.1 : (int, int)[] = prim::ListConstruct()
  %93 : int = aten::len(%images.5) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:81:22
   = prim::Loop(%93, %55) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:81:22
    block0(%94 : int):
      %im.1 : Tensor = aten::__getitem__(%images.5, %94) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:81:22
      %96 : int[] = aten::size(%im.1) # <string>:13:9
      %97 : int = aten::__getitem__(%96, %50) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:81:24
      %98 : int[] = aten::size(%im.1) # <string>:13:9
      %99 : int = aten::__getitem__(%98, %51) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:81:38
      %100 : (int, int) = prim::TupleConstruct(%97, %99)
      %101 : (int, int)[] = aten::append(%image_sizes.1, %100) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:81:22
      -> (%55)
  %image_sizes_tensor.1 : Tensor[] = prim::ListConstruct()
  %103 : int = aten::len(%image_sizes.1) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:82:29
   = prim::Loop(%103, %55) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:82:29
    block0(%104 : int):
      %x.41 : (int, int) = aten::__getitem__(%image_sizes.1, %104) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:82:29
      %106 : int, %107 : int = prim::TupleUnpack(%x.41)
      %108 : int[] = prim::ListConstruct(%106, %107)
      %109 : Tensor = aten::as_tensor(%108, %54, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\wrappers.py:25:15
      %110 : Tensor[] = aten::append(%image_sizes_tensor.1, %109) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:82:29
      -> (%55)
  %111 : Tensor = aten::stack(%image_sizes_tensor.1, %48) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:83:19
  %112 : Tensor, %113 : Tensor = aten::max(%111, %48, %44) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:83:19
  %114 : bool = aten::gt(%_size_divisibility, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:85:11
  %max_size : Tensor = prim::If(%114) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:85:8
    block0():
      %116 : int = aten::sub(%_size_divisibility, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:88:36
      %117 : Tensor = aten::add(%112, %116, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:88:24
      %118 : Tensor = aten::div(%117, %_size_divisibility, %52) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:88:24
      %max_size.5 : Tensor = aten::mul(%118, %_size_divisibility) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:88:24
      -> (%max_size.5)
    block1():
      -> (%112)
  %120 : Tensor = aten::to(%max_size, %53, %44, %44, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:92:34
  %max_size.21 : int[] = prim::tolist(%120, %43, %48)
  %122 : int = aten::len(%images.5) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:97:11
  %123 : bool = aten::eq(%122, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:97:11
  %batched_imgs : Tensor = prim::If(%123) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:97:8
    block0():
      %image_size.2 : (int, int) = aten::__getitem__(%image_sizes.1, %48) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:100:25
      %126 : int = aten::__getitem__(%max_size.21, %51) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:101:31
      %127 : int = prim::TupleIndex(%image_size.2, %43)
      %128 : int = aten::sub(%126, %127) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:101:31
      %129 : int = aten::__getitem__(%max_size.21, %50) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:101:64
      %130 : int = prim::TupleIndex(%image_size.2, %48)
      %131 : int = aten::sub(%129, %130) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:101:64
      %padding_size.1 : int[] = prim::ListConstruct(%48, %128, %48, %131)
      %133 : Tensor = aten::__getitem__(%images.5, %48) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:102:33
      %134 : int = aten::dim(%133) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torch\nn\functional.py:4362:28
      %135 : bool = aten::le(%46, %134) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torch\nn\functional.py:4362:11
       = prim::If(%135) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torch\nn\functional.py:4362:4
        block0():
          -> ()
        block1():
           = prim::RaiseException(%47, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torch\nn\functional.py:4362:4
          -> ()
      %136 : Tensor = aten::constant_pad_nd(%133, %padding_size.1, %42) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torch\nn\functional.py:4364:15
      %batched_imgs.1 : Tensor = aten::unsqueeze_(%136, %48) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:102:27
      -> (%batched_imgs.1)
    block1():
      %138 : int = aten::len(%images.5) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:105:27
      %139 : int[] = prim::ListConstruct(%138)
      %140 : Tensor = aten::__getitem__(%images.5, %48) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:105:48
      %141 : int[] = aten::size(%140) # <string>:13:9
      %142 : int[] = aten::slice(%141, %54, %50, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:105:48
      %143 : int[] = aten::list(%142) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:105:43
      %144 : int[] = aten::add(%139, %143) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:105:26
      %145 : int[] = aten::list(%max_size.21) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:105:73
      %batch_shape.1 : int[] = aten::add(%144, %145) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:105:26
      %147 : Tensor = aten::__getitem__(%images.5, %48) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:106:27
      %batched_imgs.3 : Tensor = aten::new_full(%147, %batch_shape.1, %42, %54, %54, %54, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:106:27
      %149 : int = aten::len(%images.5) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:107:12
      %150 : int = aten::len(%batched_imgs.3) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:107:12
      %151 : int[] = prim::ListConstruct(%149, %150)
      %152 : int = prim::min(%151) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:107:12
       = prim::Loop(%152, %55) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:107:12
        block0(%153 : int):
          %img.1 : Tensor = aten::__getitem__(%images.5, %153) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:107:12
          %pad_img.1 : Tensor = aten::select(%batched_imgs.3, %48, %153) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:107:12
          %156 : int[] = aten::size(%img.1) # <string>:13:9
          %157 : int = aten::__getitem__(%156, %50) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:108:31
          %158 : Tensor = aten::slice(%pad_img.1, %50, %54, %157, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:108:16
          %159 : int[] = aten::size(%img.1) # <string>:13:9
          %160 : int = aten::__getitem__(%159, %51) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:108:48
          %161 : Tensor = aten::slice(%158, %51, %54, %160, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:108:16
          %162 : Tensor = aten::copy_(%161, %img.1, %44) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:108:16
          -> (%55)
      -> (%batched_imgs.3)
  %163 : Tensor = aten::contiguous(%batched_imgs, %48) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\structures\image_list.py:110:25
  %images.2 : __torch__.detectron2.structures.image_list.ImageList = prim::CreateObject()
   = prim::SetAttr[name="tensor"](%images.2, %163)
   = prim::SetAttr[name="image_sizes"](%images.2, %image_sizes.1)
  %backbone.1 : __torch__.detectron2.modeling.backbone.fpn.___torch_mangle_389.FPN = prim::GetAttr[name="backbone"](%model)
  %tensor.51 : Tensor = prim::GetAttr[name="tensor"](%images.2)
  %bottom_up : __torch__.detectron2.modeling.backbone.resnet.___torch_mangle_381.ResNet = prim::GetAttr[name="bottom_up"](%backbone.1)
  %168 : int = aten::dim(%tensor.51) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:443:15
  %169 : bool = aten::eq(%168, %53) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:443:15
   = prim::If(%169) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:443:8
    block0():
      -> ()
    block1():
      %170 : int[] = aten::size(%tensor.51) # <string>:13:9
      %171 : str = aten::format(%38, %170) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:443:29
      %172 : str = aten::add(%49, %171) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:443:8
       = prim::RaiseException(%172, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:443:8
      -> ()
  %bottom_up_features.1 : Dict(str, Tensor) = prim::DictConstruct()
  %stem : __torch__.detectron2.modeling.backbone.resnet.___torch_mangle_348.BasicStem = prim::GetAttr[name="stem"](%bottom_up)
  %conv1.2 : __torch__.detectron2.layers.wrappers.___torch_mangle_347.Conv2d = prim::GetAttr[name="conv1"](%stem)
  %weight.21 : Tensor = prim::GetAttr[name="weight"](%conv1.2)
  %bias.34 : Tensor? = prim::GetAttr[name="bias"](%conv1.2)
  %178 : int[] = prim::ListConstruct(%46, %46)
  %179 : int[] = prim::ListConstruct(%36, %36)
  %180 : int[] = prim::ListConstruct(%43, %43)
  %x.24 : Tensor = aten::conv2d(%tensor.51, %weight.21, %bias.34, %178, %179, %180, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\wrappers.py:106:12
  %norm.7 : __torch__.detectron2.layers.batch_norm.___torch_mangle_346.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%conv1.2)
  %183 : bool = prim::requires_grad(%x.24)
  %x.22 : Tensor = prim::If(%183) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:45:8
    block0():
      %weight.23 : Tensor = prim::GetAttr[name="weight"](%norm.7)
      %running_var.14 : Tensor = prim::GetAttr[name="running_var"](%norm.7)
      %eps.14 : float = prim::GetAttr[name="eps"](%norm.7)
      %188 : Tensor = aten::add(%running_var.14, %eps.14, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:35
      %189 : Tensor = aten::rsqrt(%188) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:35
      %scale.4 : Tensor = aten::mul(%weight.23, %189) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:20
      %bias.36 : Tensor = prim::GetAttr[name="bias"](%norm.7)
      %running_mean.14 : Tensor = prim::GetAttr[name="running_mean"](%norm.7)
      %193 : Tensor = aten::mul(%running_mean.14, %scale.4) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:49:31
      %bias.38 : Tensor = aten::sub(%bias.36, %193, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:49:19
      %195 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %scale.18 : Tensor = aten::reshape(%scale.4, %195) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:50:20
      %197 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %bias.40 : Tensor = aten::reshape(%bias.38, %197) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:51:19
      %out_dtype.8 : int = prim::dtype(%x.24)
      %200 : Tensor = aten::to(%scale.18, %out_dtype.8, %44, %44, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:23
      %201 : Tensor = aten::mul(%x.24, %200) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:19
      %202 : Tensor = aten::to(%bias.40, %out_dtype.8, %44, %44, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:45
      %203 : Tensor = aten::add(%201, %202, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:19
      -> (%203)
    block1():
      %running_mean.16 : Tensor = prim::GetAttr[name="running_mean"](%norm.7)
      %running_var.16 : Tensor = prim::GetAttr[name="running_var"](%norm.7)
      %weight.25 : Tensor = prim::GetAttr[name="weight"](%norm.7)
      %bias.42 : Tensor = prim::GetAttr[name="bias"](%norm.7)
      %eps.16 : float = prim::GetAttr[name="eps"](%norm.7)
      %209 : Tensor = aten::batch_norm(%x.24, %weight.25, %bias.42, %running_mean.16, %running_var.16, %44, %37, %eps.16, %55) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torch\nn\functional.py:2421:11
      -> (%209)
  %x.16 : Tensor = aten::relu_(%x.22) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:357:12
  %211 : int[] = prim::ListConstruct(%36, %36)
  %212 : int[] = prim::ListConstruct(%46, %46)
  %213 : int[] = prim::ListConstruct(%43, %43)
  %214 : int[] = prim::ListConstruct(%43, %43)
  %x.18 : Tensor = aten::max_pool2d(%x.16, %211, %212, %213, %214, %44) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torch\nn\functional.py:797:11
  %_out_features.1 : str[] = prim::GetAttr[name="_out_features"](%bottom_up)
  %217 : bool = aten::__contains__(%_out_features.1, %39) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:446:11
   = prim::If(%217) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:446:8
    block0():
       = aten::_set_item(%bottom_up_features.1, %39, %x.18) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:447:12
      -> ()
    block1():
      -> ()
  %stage_names : (str, str, str, str) = prim::GetAttr[name="stage_names"](%bottom_up)
  %name.1 : str, %name.7 : str, %name.13 : str, %name.19 : str = prim::TupleUnpack(%stage_names)
  %stages : __torch__.torch.nn.modules.container.___torch_mangle_380.ModuleList = prim::GetAttr[name="stages"](%bottom_up)
  %_0.1 : __torch__.torch.nn.modules.container.___torch_mangle_355.Sequential = prim::GetAttr[name="0"](%stages)
  %_1.1 : __torch__.torch.nn.modules.container.___torch_mangle_363.Sequential = prim::GetAttr[name="1"](%stages)
  %_2.1 : __torch__.torch.nn.modules.container.___torch_mangle_371.Sequential = prim::GetAttr[name="2"](%stages)
  %_3.1 : __torch__.torch.nn.modules.container.___torch_mangle_379.Sequential = prim::GetAttr[name="3"](%stages)
  %_0.3 : __torch__.detectron2.modeling.backbone.resnet.___torch_mangle_352.BottleneckBlock = prim::GetAttr[name="0"](%_0.1)
  %_1.3 : __torch__.detectron2.modeling.backbone.resnet.___torch_mangle_354.BottleneckBlock = prim::GetAttr[name="1"](%_0.1)
  %_2.3 : __torch__.detectron2.modeling.backbone.resnet.___torch_mangle_354.BottleneckBlock = prim::GetAttr[name="2"](%_0.1)
  %conv1.4 : __torch__.detectron2.layers.wrappers.___torch_mangle_350.Conv2d = prim::GetAttr[name="conv1"](%_0.3)
  %weight.27 : Tensor = prim::GetAttr[name="weight"](%conv1.4)
  %bias.44 : Tensor? = prim::GetAttr[name="bias"](%conv1.4)
  %234 : int[] = prim::ListConstruct(%43, %43)
  %235 : int[] = prim::ListConstruct(%48, %48)
  %236 : int[] = prim::ListConstruct(%43, %43)
  %x.28 : Tensor = aten::conv2d(%x.18, %weight.27, %bias.44, %234, %235, %236, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\wrappers.py:106:12
  %norm.9 : __torch__.detectron2.layers.batch_norm.___torch_mangle_346.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%conv1.4)
  %239 : bool = prim::requires_grad(%x.28)
  %out.3 : Tensor = prim::If(%239) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:45:8
    block0():
      %weight.29 : Tensor = prim::GetAttr[name="weight"](%norm.9)
      %running_var.18 : Tensor = prim::GetAttr[name="running_var"](%norm.9)
      %eps.18 : float = prim::GetAttr[name="eps"](%norm.9)
      %244 : Tensor = aten::add(%running_var.18, %eps.18, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:35
      %245 : Tensor = aten::rsqrt(%244) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:35
      %scale.20 : Tensor = aten::mul(%weight.29, %245) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:20
      %bias.46 : Tensor = prim::GetAttr[name="bias"](%norm.9)
      %running_mean.18 : Tensor = prim::GetAttr[name="running_mean"](%norm.9)
      %249 : Tensor = aten::mul(%running_mean.18, %scale.20) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:49:31
      %bias.48 : Tensor = aten::sub(%bias.46, %249, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:49:19
      %251 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %scale.22 : Tensor = aten::reshape(%scale.20, %251) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:50:20
      %253 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %bias.50 : Tensor = aten::reshape(%bias.48, %253) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:51:19
      %out_dtype.10 : int = prim::dtype(%x.28)
      %256 : Tensor = aten::to(%scale.22, %out_dtype.10, %44, %44, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:23
      %257 : Tensor = aten::mul(%x.28, %256) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:19
      %258 : Tensor = aten::to(%bias.50, %out_dtype.10, %44, %44, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:45
      %259 : Tensor = aten::add(%257, %258, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:19
      -> (%259)
    block1():
      %running_mean.20 : Tensor = prim::GetAttr[name="running_mean"](%norm.9)
      %running_var.20 : Tensor = prim::GetAttr[name="running_var"](%norm.9)
      %weight.31 : Tensor = prim::GetAttr[name="weight"](%norm.9)
      %bias.52 : Tensor = prim::GetAttr[name="bias"](%norm.9)
      %eps.20 : float = prim::GetAttr[name="eps"](%norm.9)
      %265 : Tensor = aten::batch_norm(%x.28, %weight.31, %bias.52, %running_mean.20, %running_var.20, %44, %37, %eps.20, %55) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torch\nn\functional.py:2421:11
      -> (%265)
  %out.7 : Tensor = aten::relu_(%out.3) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:196:14
  %conv2.2 : __torch__.detectron2.layers.wrappers.___torch_mangle_351.Conv2d = prim::GetAttr[name="conv2"](%_0.3)
  %weight.33 : Tensor = prim::GetAttr[name="weight"](%conv2.2)
  %bias.54 : Tensor? = prim::GetAttr[name="bias"](%conv2.2)
  %270 : int[] = prim::ListConstruct(%43, %43)
  %271 : int[] = prim::ListConstruct(%43, %43)
  %272 : int[] = prim::ListConstruct(%43, %43)
  %x.30 : Tensor = aten::conv2d(%out.7, %weight.33, %bias.54, %270, %271, %272, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\wrappers.py:106:12
  %norm.11 : __torch__.detectron2.layers.batch_norm.___torch_mangle_346.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%conv2.2)
  %275 : bool = prim::requires_grad(%x.30)
  %out.11 : Tensor = prim::If(%275) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:45:8
    block0():
      %weight.35 : Tensor = prim::GetAttr[name="weight"](%norm.11)
      %running_var.22 : Tensor = prim::GetAttr[name="running_var"](%norm.11)
      %eps.22 : float = prim::GetAttr[name="eps"](%norm.11)
      %280 : Tensor = aten::add(%running_var.22, %eps.22, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:35
      %281 : Tensor = aten::rsqrt(%280) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:35
      %scale.24 : Tensor = aten::mul(%weight.35, %281) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:20
      %bias.56 : Tensor = prim::GetAttr[name="bias"](%norm.11)
      %running_mean.22 : Tensor = prim::GetAttr[name="running_mean"](%norm.11)
      %285 : Tensor = aten::mul(%running_mean.22, %scale.24) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:49:31
      %bias.58 : Tensor = aten::sub(%bias.56, %285, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:49:19
      %287 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %scale.26 : Tensor = aten::reshape(%scale.24, %287) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:50:20
      %289 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %bias.60 : Tensor = aten::reshape(%bias.58, %289) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:51:19
      %out_dtype.12 : int = prim::dtype(%x.30)
      %292 : Tensor = aten::to(%scale.26, %out_dtype.12, %44, %44, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:23
      %293 : Tensor = aten::mul(%x.30, %292) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:19
      %294 : Tensor = aten::to(%bias.60, %out_dtype.12, %44, %44, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:45
      %295 : Tensor = aten::add(%293, %294, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:19
      -> (%295)
    block1():
      %running_mean.24 : Tensor = prim::GetAttr[name="running_mean"](%norm.11)
      %running_var.24 : Tensor = prim::GetAttr[name="running_var"](%norm.11)
      %weight.37 : Tensor = prim::GetAttr[name="weight"](%norm.11)
      %bias.62 : Tensor = prim::GetAttr[name="bias"](%norm.11)
      %eps.24 : float = prim::GetAttr[name="eps"](%norm.11)
      %301 : Tensor = aten::batch_norm(%x.30, %weight.37, %bias.62, %running_mean.24, %running_var.24, %44, %37, %eps.24, %55) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torch\nn\functional.py:2421:11
      -> (%301)
  %out.15 : Tensor = aten::relu_(%out.11) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:199:14
  %conv3.2 : __torch__.detectron2.layers.wrappers.___torch_mangle_349.Conv2d = prim::GetAttr[name="conv3"](%_0.3)
  %weight.39 : Tensor = prim::GetAttr[name="weight"](%conv3.2)
  %bias.64 : Tensor? = prim::GetAttr[name="bias"](%conv3.2)
  %306 : int[] = prim::ListConstruct(%43, %43)
  %307 : int[] = prim::ListConstruct(%48, %48)
  %308 : int[] = prim::ListConstruct(%43, %43)
  %x.32 : Tensor = aten::conv2d(%out.15, %weight.39, %bias.64, %306, %307, %308, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\wrappers.py:106:12
  %norm.13 : __torch__.detectron2.layers.batch_norm.___torch_mangle_346.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%conv3.2)
  %311 : bool = prim::requires_grad(%x.32)
  %out.19 : Tensor = prim::If(%311) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:45:8
    block0():
      %weight.41 : Tensor = prim::GetAttr[name="weight"](%norm.13)
      %running_var.26 : Tensor = prim::GetAttr[name="running_var"](%norm.13)
      %eps.26 : float = prim::GetAttr[name="eps"](%norm.13)
      %316 : Tensor = aten::add(%running_var.26, %eps.26, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:35
      %317 : Tensor = aten::rsqrt(%316) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:35
      %scale.28 : Tensor = aten::mul(%weight.41, %317) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:20
      %bias.66 : Tensor = prim::GetAttr[name="bias"](%norm.13)
      %running_mean.26 : Tensor = prim::GetAttr[name="running_mean"](%norm.13)
      %321 : Tensor = aten::mul(%running_mean.26, %scale.28) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:49:31
      %bias.68 : Tensor = aten::sub(%bias.66, %321, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:49:19
      %323 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %scale.30 : Tensor = aten::reshape(%scale.28, %323) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:50:20
      %325 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %bias.70 : Tensor = aten::reshape(%bias.68, %325) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:51:19
      %out_dtype.14 : int = prim::dtype(%x.32)
      %328 : Tensor = aten::to(%scale.30, %out_dtype.14, %44, %44, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:23
      %329 : Tensor = aten::mul(%x.32, %328) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:19
      %330 : Tensor = aten::to(%bias.70, %out_dtype.14, %44, %44, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:45
      %331 : Tensor = aten::add(%329, %330, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:19
      -> (%331)
    block1():
      %running_mean.28 : Tensor = prim::GetAttr[name="running_mean"](%norm.13)
      %running_var.28 : Tensor = prim::GetAttr[name="running_var"](%norm.13)
      %weight.43 : Tensor = prim::GetAttr[name="weight"](%norm.13)
      %bias.72 : Tensor = prim::GetAttr[name="bias"](%norm.13)
      %eps.28 : float = prim::GetAttr[name="eps"](%norm.13)
      %337 : Tensor = aten::batch_norm(%x.32, %weight.43, %bias.72, %running_mean.28, %running_var.28, %44, %37, %eps.28, %55) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torch\nn\functional.py:2421:11
      -> (%337)
  %shortcut.4 : __torch__.detectron2.layers.wrappers.___torch_mangle_349.Conv2d = prim::GetAttr[name="shortcut"](%_0.3)
  %weight.45 : Tensor = prim::GetAttr[name="weight"](%shortcut.4)
  %bias.74 : Tensor? = prim::GetAttr[name="bias"](%shortcut.4)
  %341 : int[] = prim::ListConstruct(%43, %43)
  %342 : int[] = prim::ListConstruct(%48, %48)
  %343 : int[] = prim::ListConstruct(%43, %43)
  %x.34 : Tensor = aten::conv2d(%x.18, %weight.45, %bias.74, %341, %342, %343, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\wrappers.py:106:12
  %norm.15 : __torch__.detectron2.layers.batch_norm.___torch_mangle_346.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%shortcut.4)
  %346 : bool = prim::requires_grad(%x.34)
  %shortcut.6 : Tensor = prim::If(%346) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:45:8
    block0():
      %weight.47 : Tensor = prim::GetAttr[name="weight"](%norm.15)
      %running_var.30 : Tensor = prim::GetAttr[name="running_var"](%norm.15)
      %eps.30 : float = prim::GetAttr[name="eps"](%norm.15)
      %351 : Tensor = aten::add(%running_var.30, %eps.30, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:35
      %352 : Tensor = aten::rsqrt(%351) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:35
      %scale.32 : Tensor = aten::mul(%weight.47, %352) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:20
      %bias.76 : Tensor = prim::GetAttr[name="bias"](%norm.15)
      %running_mean.30 : Tensor = prim::GetAttr[name="running_mean"](%norm.15)
      %356 : Tensor = aten::mul(%running_mean.30, %scale.32) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:49:31
      %bias.78 : Tensor = aten::sub(%bias.76, %356, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:49:19
      %358 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %scale.34 : Tensor = aten::reshape(%scale.32, %358) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:50:20
      %360 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %bias.80 : Tensor = aten::reshape(%bias.78, %360) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:51:19
      %out_dtype.16 : int = prim::dtype(%x.34)
      %363 : Tensor = aten::to(%scale.34, %out_dtype.16, %44, %44, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:23
      %364 : Tensor = aten::mul(%x.34, %363) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:19
      %365 : Tensor = aten::to(%bias.80, %out_dtype.16, %44, %44, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:45
      %366 : Tensor = aten::add(%364, %365, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:19
      -> (%366)
    block1():
      %running_mean.32 : Tensor = prim::GetAttr[name="running_mean"](%norm.15)
      %running_var.32 : Tensor = prim::GetAttr[name="running_var"](%norm.15)
      %weight.49 : Tensor = prim::GetAttr[name="weight"](%norm.15)
      %bias.82 : Tensor = prim::GetAttr[name="bias"](%norm.15)
      %eps.32 : float = prim::GetAttr[name="eps"](%norm.15)
      %372 : Tensor = aten::batch_norm(%x.34, %weight.49, %bias.82, %running_mean.32, %running_var.32, %44, %37, %eps.32, %55) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torch\nn\functional.py:2421:11
      -> (%372)
  %out.23 : Tensor = aten::add_(%out.19, %shortcut.6, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:208:8
  %input.6 : Tensor = aten::relu_(%out.23) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:209:14
  %conv1.6 : __torch__.detectron2.layers.wrappers.___torch_mangle_353.Conv2d = prim::GetAttr[name="conv1"](%_1.3)
  %weight.51 : Tensor = prim::GetAttr[name="weight"](%conv1.6)
  %bias.84 : Tensor? = prim::GetAttr[name="bias"](%conv1.6)
  %378 : int[] = prim::ListConstruct(%43, %43)
  %379 : int[] = prim::ListConstruct(%48, %48)
  %380 : int[] = prim::ListConstruct(%43, %43)
  %x.36 : Tensor = aten::conv2d(%input.6, %weight.51, %bias.84, %378, %379, %380, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\wrappers.py:106:12
  %norm.17 : __torch__.detectron2.layers.batch_norm.___torch_mangle_346.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%conv1.6)
  %383 : bool = prim::requires_grad(%x.36)
  %out.25 : Tensor = prim::If(%383) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:45:8
    block0():
      %weight.53 : Tensor = prim::GetAttr[name="weight"](%norm.17)
      %running_var.34 : Tensor = prim::GetAttr[name="running_var"](%norm.17)
      %eps.34 : float = prim::GetAttr[name="eps"](%norm.17)
      %388 : Tensor = aten::add(%running_var.34, %eps.34, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:35
      %389 : Tensor = aten::rsqrt(%388) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:35
      %scale.36 : Tensor = aten::mul(%weight.53, %389) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:20
      %bias.86 : Tensor = prim::GetAttr[name="bias"](%norm.17)
      %running_mean.34 : Tensor = prim::GetAttr[name="running_mean"](%norm.17)
      %393 : Tensor = aten::mul(%running_mean.34, %scale.36) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:49:31
      %bias.88 : Tensor = aten::sub(%bias.86, %393, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:49:19
      %395 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %scale.38 : Tensor = aten::reshape(%scale.36, %395) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:50:20
      %397 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %bias.90 : Tensor = aten::reshape(%bias.88, %397) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:51:19
      %out_dtype.18 : int = prim::dtype(%x.36)
      %400 : Tensor = aten::to(%scale.38, %out_dtype.18, %44, %44, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:23
      %401 : Tensor = aten::mul(%x.36, %400) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:19
      %402 : Tensor = aten::to(%bias.90, %out_dtype.18, %44, %44, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:45
      %403 : Tensor = aten::add(%401, %402, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:19
      -> (%403)
    block1():
      %running_mean.36 : Tensor = prim::GetAttr[name="running_mean"](%norm.17)
      %running_var.36 : Tensor = prim::GetAttr[name="running_var"](%norm.17)
      %weight.55 : Tensor = prim::GetAttr[name="weight"](%norm.17)
      %bias.92 : Tensor = prim::GetAttr[name="bias"](%norm.17)
      %eps.36 : float = prim::GetAttr[name="eps"](%norm.17)
      %409 : Tensor = aten::batch_norm(%x.36, %weight.55, %bias.92, %running_mean.36, %running_var.36, %44, %37, %eps.36, %55) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torch\nn\functional.py:2421:11
      -> (%409)
  %out.27 : Tensor = aten::relu_(%out.25) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:196:14
  %conv2.4 : __torch__.detectron2.layers.wrappers.___torch_mangle_351.Conv2d = prim::GetAttr[name="conv2"](%_1.3)
  %weight.57 : Tensor = prim::GetAttr[name="weight"](%conv2.4)
  %bias.94 : Tensor? = prim::GetAttr[name="bias"](%conv2.4)
  %414 : int[] = prim::ListConstruct(%43, %43)
  %415 : int[] = prim::ListConstruct(%43, %43)
  %416 : int[] = prim::ListConstruct(%43, %43)
  %x.38 : Tensor = aten::conv2d(%out.27, %weight.57, %bias.94, %414, %415, %416, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\wrappers.py:106:12
  %norm.19 : __torch__.detectron2.layers.batch_norm.___torch_mangle_346.FrozenBatchNorm2d = prim::GetAttr[name="norm"](%conv2.4)
  %419 : bool = prim::requires_grad(%x.38)
  %out.29 : Tensor = prim::If(%419) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:45:8
    block0():
      %weight.59 : Tensor = prim::GetAttr[name="weight"](%norm.19)
      %running_var.38 : Tensor = prim::GetAttr[name="running_var"](%norm.19)
      %eps.38 : float = prim::GetAttr[name="eps"](%norm.19)
      %424 : Tensor = aten::add(%running_var.38, %eps.38, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:35
      %425 : Tensor = aten::rsqrt(%424) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:35
      %scale.40 : Tensor = aten::mul(%weight.59, %425) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:48:20
      %bias.96 : Tensor = prim::GetAttr[name="bias"](%norm.19)
      %running_mean.38 : Tensor = prim::GetAttr[name="running_mean"](%norm.19)
      %429 : Tensor = aten::mul(%running_mean.38, %scale.40) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:49:31
      %bias.98 : Tensor = aten::sub(%bias.96, %429, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:49:19
      %431 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %scale.42 : Tensor = aten::reshape(%scale.40, %431) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:50:20
      %433 : int[] = prim::ListConstruct(%43, %51, %43, %43)
      %bias.100 : Tensor = aten::reshape(%bias.98, %433) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:51:19
      %out_dtype.20 : int = prim::dtype(%x.38)
      %436 : Tensor = aten::to(%scale.42, %out_dtype.20, %44, %44, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:23
      %437 : Tensor = aten::mul(%x.38, %436) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:19
      %438 : Tensor = aten::to(%bias.100, %out_dtype.20, %44, %44, %54) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:45
      %439 : Tensor = aten::add(%437, %438, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\batch_norm.py:53:19
      -> (%439)
    block1():
      %running_mean.40 : Tensor = prim::GetAttr[name="running_mean"](%norm.19)
      %running_var.40 : Tensor = prim::GetAttr[name="running_var"](%norm.19)
      %weight.61 : Tensor = prim::GetAttr[name="weight"](%norm.19)
      %bias.102 : Tensor = prim::GetAttr[name="bias"](%norm.19)
      %eps.40 : float = prim::GetAttr[name="eps"](%norm.19)
      %445 : Tensor = aten::batch_norm(%x.38, %weight.61, %bias.102, %running_mean.40, %running_var.40, %44, %37, %eps.40, %55) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\torch\nn\functional.py:2421:11
      -> (%445)
  %out.31 : Tensor = aten::relu_(%out.29) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\modeling\backbone\resnet.py:199:14
  %conv3.4 : __torch__.detectron2.layers.wrappers.___torch_mangle_349.Conv2d = prim::GetAttr[name="conv3"](%_1.3)
  %weight.63 : Tensor = prim::GetAttr[name="weight"](%conv3.4)
  %bias.104 : Tensor? = prim::GetAttr[name="bias"](%conv3.4)
  %450 : int[] = prim::ListConstruct(%43, %43)
  %451 : int[] = prim::ListConstruct(%48, %48)
  %452 : int[] = prim::ListConstruct(%43, %43)
  %x.40 : Tensor = aten::conv2d(%out.31, %weight.63, %bias.104, %450, %451, %452, %43) # C:\Miniconda3\envs\tron2_copy\lib\site-packages\detectron2\layers\wrappers.py:106:12
